[
  {
    "id": 1,
    "title": "Static Site",
    "content": "You might be wondering what a static site is and i am here to tell you. This is a when a site is made up of fixed files that can be set to deploy a website. This is more ideal for blog sites where the data information can be displayed statically and in place."
  },
  {
    "id": 2,
    "title": "Tech Stacks",
    "content": "Tech stacks consistent of certain group of frameworks and libraries when creating websites or applications. For example the MERN stack which sticks to a Javascript framework. It consists of MongoDB, Express.js, React.js, and Node.js and is one of the most popular choices in web developments."
  },
  {
    "id": 3,
    "title": "API basis",
    "content": "API consists of data that can be used in your projects instead of storing the data internally. One API i have used before is the spotify API which list a bunch of information containing music data. This allows you send request to Spotify for certain data through http requests."
  },
  {
    "id": 4,
    "title": "Best Practices for using APIs within React",
    "content": "When handling APIs there is a lot of practice that can be made to ensure your code runs smoothly and as efficient as possible. Such as adding handling error messages in order to ensure if there is an issue you can know what in your code is needed to be fixed. Another good practice to include is to not show API keys publicly. What I mean by this is you want to handle API calling in the backend. You also want to keep keys in a seperate file in your backend for better security.",
    "image": "practice-api.png"
  },
  {
    "id": 4,
    "title": "React Native",
    "content": "Im sure a lot of you are familiar with React which is a front end framework to help you generate website with much more ease. But that is not why we are here we are here to talk about React Native which is similar but also slightly different. React Native is also a framework but its more catered to mobile applications instead of websites. Similar features like use of navigation except its meant for mobile apps. Pretty much already knowing React might help you use their mobile framework native with just as much ease.",
    "image": "practice-api.png"
  }
]
